jorgebucaran/fisher
jorgebucaran/nvm.fish
patrickf1/fzf.fish
jorgebucaran/autopair.fish
jorgebucaran/replay.fish
nickeb96/puffer-fish
gazorby/fish-abbreviation-tips
joehillen/to-fish
patrickf1/colored_man_pages.fish
oakninja/makemefish
brewingweasel/fishbang
aohorodnyk/fish-autovenv
alaz-oz/fish-insulter
joseluisq/gitnow
franciscolourenco/done
paldepind/projectdo
danhper/fish-ssh-agent
